{"data":{"markdownRemark":{"frontmatter":{"title":"Mathematical morphology visualized","date":"2019-08-14","tags":["computer vision","image analysis","math"]},"html":"<h2>Mathematical Morphology</h2>\n<p>Mathematical morphology uses set theory to describe shapes. In image processing, operators from mathematical morphology can be used to pre-process or post-process images. The basic four morphological operators are dilation, erosion, opening, and closing. All operations involve an <strong>structuring element</strong>, and the result of each operation really describes the interaction between the input image and the structuring element. These operations are also usually performed for binary images. There are functions defined in OpenCV that applies these four operations. I will include these functions below, as they are super easy to use. You only need two inputs: the input image and a structuring element. Definitely play around with them, but the visualization below shows you exactly what each operation is doing.</p>\n<p>In the examples below, the structuring element is 3 pixels by 3 pixels. You can think of it as a filter or kernel, similar to convolution. An <em>anchor</em> is defined for each structuring element that maps to each pixels of the output. In openCV, you can specify the size of the kernel, such as a 5x5 kernel (assuming background is 0 and foreground is 1):</p>\n<pre><code>kernel = np.ones((5,5) , np.uint8)\n</code></pre>\n<p>In the visualizations below, the left image is the input image, and the right image is the output as the structuring element is slid across. Each box represents a pixel. An orange pixel represents a pixel in the foreground, while a grey pixel is part of the background. The final output is displayed when the structuring element has slid through all the output pixels.</p>\n<h2>Dilation</h2>\n<p>This operation \"dilates\" the shape in the image. This means that it can smooth out some nooks and crannies in the original image shape. This operation is associative as well as commutative!</p>\n<p>When sliding the structuring element, each output pixel that was originally in the background (grey) can either stay grey or turn to the foreground (orange).</p>\n<p><strong>Rules:</strong></p>\n<ul>\n<li>Any overlap of structuring element and orange pixel, output turns orange.</li>\n<li>No overlap of structuring element and orange pixel, output stays grey.</li>\n</ul>\n<p><img src=\"/dialate-d6ec2fc1995eeeb95b917db2c6e1cea0.gif\"></p>\n<pre><code>dilation = cv2.dilate(input_img, kernel , iterations = 1)\n</code></pre>\n<h2>Erosion</h2>\n<p>This operation \"erodes\" the shape in the image. This means that it can smooth out rough edges in the original image shape. The idea is that a foreground pixel will remain if you can fit the whole structuring element anchored at that pixel. This operation is not associative nor commutative!</p>\n<p>When sliding the structuring element, each output pixel that was originally in the foreground (orange) can either stay orange or turn into the background (grey).</p>\n<p><strong>Rules:</strong></p>\n<ul>\n<li>Full overlap of structuring element and orange pixel, output stays orange.</li>\n<li>Else, output turns grey.</li>\n</ul>\n<p><img src=\"/erode-b4f8cd8e2ed187ab5ae45f3b8134b940.gif\"></p>\n<pre><code>erosion = cv2.erode(input_img, kernel , iterations = 1)\n</code></pre>\n<h2>Opening</h2>\n<p>First apply erosion, then apply dilation! This operation is useful for removing noise. This is because the first erosion will remove any shape in the original image that is smaller that the structuring element, but also shrinking the shape that we want. Then the dilation will reverse the shrinking, but it will not bring back the \"noise.\"</p>\n<pre><code>opening = cv2.morphologyEx(input_img, cv2.MORPH_OPEN, kernel)\n</code></pre>\n<h2>Closing</h2>\n<p>First apply dilation, then apply erosion! This operation is useful for \"closing\" holes in the shape that we want, or foreground. This is because when we first apply dilation, the holes will be closed, but the main shape will enlarge. Then the erosion will reverse the enlargement of the main shape, so the effects of closing really is just closing the holes.</p>\n<pre><code>closing = cv2.morphologyEx(input_img, cv2.MORPH_CLOSE, kernel)\n</code></pre>\n<h2>Bonus round</h2>\n<p>If you want to think about the duality of dilation and erosion, then you can say that dilating the “foreground” is the same as eroding the “background”, and likewise, eroding the foreground is the same as dilating the background! So each operation is the set compliment of the other, with reflecting structuring element! Mind == blown ? lol</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"mathematical-morphology"}}