{"data":{"markdownRemark":{"frontmatter":{"title":"Distributed Deep Learning","date":"2019-10-20","tags":["neural network","deep learning","parallelism"]},"html":"<p>We all know that GPUs can speed up training time of neural network models over CPUs due to its parallel nature as kinda demonstrated from my previous post. Recently, a friend who read my post asked me...if training on GPUs is so effective, why don't you just have multiple GPUs and stack them up to decrease training time..because..parallelism. Intuitively, this makes a lot of sense, more hardware resources means more computing power, which means less training time. But now the question is HOW? What is the best way to split up the work load of training a neural network model onto multiple GPUs? Will there be a problem of diminishing returns? These are the questions that I could not answer...until now!</p>\n<h2>Initial Thoughts</h2>\n<p>Training neural networks is, surprisingly, a simple problem. Stochastic gradient descent (SDG) with minibatches and its variants remain, at least for now, the most popular methods for training deep neural networks. When you ignore the fancy weight update functions/optimizers (adaptive learning rate, momentum, Adam ect.), SDG essentially becomes a forloop to calculate the gradients and update the weights. The bare bones of SDG for training a neural network literally looks something like this:</p>\n<pre><code>  for number of iterations:\n      for samples in dataset:\n          model.forward\n          loss.backward\n          new weights &#x3C;- old weights - learning_rate * gradient\n</code></pre>\n<p>Below is the above algorithm in a more mathy way:</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math><semantics><mrow><msup><mi>w</mi><mrow><mi>t</mi><mo>+</mo><mn>1</mn></mrow></msup></mrow><annotation encoding=\"application/x-tex\">w^{t+1}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.8141079999999999em;vertical-align:0em;\"></span><span class=\"mord\"><span class=\"mord mathdefault\" style=\"margin-right:0.02691em;\">w</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8141079999999999em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathdefault mtight\">t</span><span class=\"mbin mtight\">+</span><span class=\"mord mtight\">1</span></span></span></span></span></span></span></span></span></span></span></span></p>\n<p>You have the training dataset that consists of some number of samples. Each sample contributes to the gradient in a small way. We can update the weights after a single sample, or we can compute the average gradients contributed from each sample in a group of samples (minibatch), and then update the weights for each minibatch by simply taking a step in the negative direction. Usually, updating after each minibatch is more stable than updating after each sample because taking the average of the gradient reduces the variance of the gradient estimate. Now, you are probably wondering why can't the minibatch size can be the whole training input, so you can update the weights once for the whole dataset (batch gradient descent). The answer is usually we are limited by memory, aka, the entire dataset will probably not fit in memory if we want to do one pass for the entire dataset. All this talk about SDG and its variants may be confusing, let me clear things up a bit through the summary below:</p>\n<h4>Quick Summary of SDG</h4>\n<h5>Stochastic Gradient Descent - updates weights after EACH sample</h5>\n<ul>\n<li>more frequent updates may result in faster convergence</li>\n<li>more frequent updates is also computationally expensive</li>\n<li>each update is noisy..may be good for getting out of local minima</li>\n<li>noisy = larger variance = non optimal convergence</li>\n</ul>\n<h5>Batch Gradient Descent - updates weights after ALL samples in dataset</h5>\n<ul>\n<li>fewer updates = better computational efficiency</li>\n<li>more stable convergence since each update is a better approximation of true gradient</li>\n<li>Stable can also mean premature convergence :( rip</li>\n<li>no memory to fit whole dataset</li>\n</ul>\n<h5>Minibatch Stochastic Gradient Descent - updates weights after a MINIBATCH of samples</h5>\n<ul>\n<li>best of both worlds of the 2 variants above</li>\n<li>but need to have a hyper parameter of minibatch size</li>\n</ul>\n<p>In the end, minibatch SGD is the most prominently used in deep learning training. So let's assume that the \"samples\" in the above training pseudo code is minibatch. Therefore, we are simply looking at parallelizing the inner forloop, since there is dependency in the outer epoch forloop. To be honest, we don't have much to work with. This could be good and bad, haha. This leads to the three types of parallelism techniques below:  </p>\n<h2>Data Parallelism</h2>\n<p>Self explanatory.</p>\n<p>From the training pseudo code above, it is easy to see that a straight forward approach to parallelize the forloop is by processing different groups of minibatch samples on different GPUs. This is similar to the idea of using minibatch gradient descent, but scaled to multiple GPUs.</p>\n<h2>Model Parallelism</h2>\n<p>Self explanatory. Include pic.</p>\n<h2>Pipelining</h2>\n<p>Each GPU processes a layer. Since each layer depends on the previous layer, we have to pipeline it. So basically, pipelining is a combination of data parallelism and model parallelism since the samples are processes in parallel as they are fed into the pipeline as well as the depth of the pipeline is determined by the number of layers in the model.</p>\n<h2>Resources</h2>\n<ul>\n<li><a href=\"https://arxiv.org/pdf/1802.09941.pdf\">https://arxiv.org/pdf/1802.09941.pdf</a></li>\n<li><a href=\"https://arxiv.org/pdf/1811.03600.pdf\">https://arxiv.org/pdf/1811.03600.pdf</a></li>\n</ul>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"data-parallelism"}}